posts/using-matrix.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-23 Sat 13:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="css/my-dark.css"/>
</head>
<body>
<div id="preamble" class="status">
<a href="../index.html">home</a>
<a href="../posts/articles.html">essays</a>
<a href="../personal/articles.html">diary</a>
<a href="https://git.awful.club/projects">projects</a>
<a href="../resume.pdf">resume</a>
</div>
<div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd1d203d">1. introduction</a></li>
<li><a href="#orgd355b3b">2. what am i doing with matrix</a>
<ul>
<li><a href="#orgbb87b0f">2.1. clients</a></li>
<li><a href="#orgd1ca908">2.2. servers</a></li>
<li><a href="#orgb2d4919">2.3. bridges</a>
<ul>
<li><a href="#orga90b482">2.3.1. slack</a></li>
<li><a href="#orgcaa0fd4">2.3.2. irc</a></li>
<li><a href="#org7f847c8">2.3.3. discord</a></li>
<li><a href="#org4290f18">2.3.4. combining bridges in a single room</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3887808">3. avoiding common pitfalls of self hosting</a>
<ul>
<li><a href="#org9b16adb">3.1. deployment</a></li>
<li><a href="#orgf5a2b73">3.2. disk space</a></li>
<li><a href="#org915de9a">3.3. backups!</a></li>
</ul>
</li>
<li><a href="#orgfebc999">4. talk to me about matrix!</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgd1d203d" class="outline-2">
<h2 id="orgd1d203d"><span class="section-number-2">1</span> introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
i wanna write about <a href="https://matrix.org">matrix</a>. matrix is a 'new' protocol for decentralized communication. it can be used in a bunch of different ways: from relatively secure, favoring security over ease of use, to very open, favoring ease of use over all other concerns. i tend to use it in the, to me, bare minimum secure configuration and then focusing hard on ease of use.
</p>

<ul class="org-ul">
<li>i use e2ee by default</li>
<li>i self host my home server</li>
<li>i allow federation</li>
</ul>

<p>
i like that i can expect message <i>content</i> privacy and also retain relative ease of use within the same platform. i like that that i can bridge a bunch of services to a single chat client (albeit with some uh, effort / UX trade-offs). i like that there exists reference apps for basically every platform i care about (and basically all the platforms my friends care about).
</p>

<p>
i really like matrix! but its fair to say there are also problems with it. if you're familiar with matrix at all you <a href="https://matrix.org/blog/2019/04/11/we-have-discovered-and-addressed-a-security-breach-updated-2019-04-12">probably heard about their big security fuck up</a>. earlier, i wrote specifically that you can expect message <i>content</i> privacy, and i'll add here that you cannot expect message <i>metadata</i> privacy (for example, read the <a href="https://news.ycombinator.com/item?id=23108750">first half of tptacek's reply on HN about contact lists in matrix vs signal</a>). if you self host, there's an even bigger metadata leak than for users who use a larger existing deployment.
</p>

<p>
i don't wanna convince you that matrix is the protocol of your dreams and you should use it. i just wanna talk about what i'm using it for and maybe help a few folks who ran into some of the same issues i've now solved.
</p>
</div>
</div>

<div id="outline-container-orgd355b3b" class="outline-2">
<h2 id="orgd355b3b"><span class="section-number-2">2</span> what am i doing with matrix</h2>
<div class="outline-text-2" id="text-2">
<p>
one of the most fun / worst things about using matrix is that there's a bajillion knobs to tweak; anyone who is using it could have anywhere from 1 to n things different from my setup. here's what i'm doing:
</p>
</div>

<div id="outline-container-orgbb87b0f" class="outline-3">
<h3 id="orgbb87b0f"><span class="section-number-3">2.1</span> clients</h3>
<div class="outline-text-3" id="text-2-1">
<p>
i'm using standard element clients for linux, macOS, iOS, and android.
</p>

<p>
i'm paying attention to ditto and nio as mobile clients; ditto is made by someone from my city which is rad! its purple, which is rad! nio is <i>also</i> purple, so its also rad. i've played with the weechat-matrix plugin which i think fucking sucks. i've played with mirage, nheko, and a few others that just seemed incomplete. i'm hopeful that the KDE folks get a reasonably good client going with <a href="https://blogs.kde.org/2017/09/05/konversation-2x-2018-new-user-interface-matrix-support-mobile-version">konversations2</a>, but man the last meaningful update i've seen is ages old.
</p>

<p>
since originally writing ^ that paragraph, the new hotness for KDE clients is <a href="https://github.com/KDE/neochat">neochat</a>; I've only cursorily looked at this but it seems like is heading the right direction. Additionally, Nheko has received a bunch of updates and its one of the desktop linux clients i'll be trying out next. I've also tried the <a href="https://github.com/matrix-org/purple-matrix">libpurple plugin</a> which is, like, fine I guess. its libpurple. Its not feature complete and it has all the drawbacks of libpurple. I wouldn't use it.
</p>
</div>
</div>


<div id="outline-container-orgd1ca908" class="outline-3">
<h3 id="orgd1ca908"><span class="section-number-3">2.2</span> servers</h3>
<div class="outline-text-3" id="text-2-2">
<p>
i'm using the <a href="https://github.com/matrix-org/synapse">synapse reference server</a>, written in python. there really aren't other options here at the moment. dendrite (written in go) looks like it will no longer be the successor to Synapse, and instead just be a testing ground. there are a few rust servers being worked on as well, but with less official support.
</p>
</div>
</div>

<div id="outline-container-orgb2d4919" class="outline-3">
<h3 id="orgb2d4919"><span class="section-number-3">2.3</span> bridges</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orga90b482" class="outline-4">
<h4 id="orga90b482"><span class="section-number-4">2.3.1</span> slack</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
i'm currently using the <a href="https://github.com/matrix-org/matrix-appservice-slack">matrix-appservice-slack bridge</a> to bridge my local family and friends slack to my matrix server. this lets me do two things that are important to me:
</p>

<ul class="org-ul">
<li>pull in all messages in my public channels to my element instance, which lets me capture logs (slack requires that you pay a non-trivial amount of money per user per month if you want to have access to historic data)</li>
<li>talk to my friends in slack from my element client.</li>
</ul>

<p>
the second one makes me feel like i'm 12, using trillian and setting away messages in aim. i love it.
</p>

<p>
all the data replicates without hiccups between my synapse instance and the slack api, but the presentation of threaded messages in the element clients sucks, frankly. there's <a href="https://github.com/vector-im/riot-web/issues/2349">a bug</a> filed for it but what the final implementation will look like is anyone's guess.
</p>
</div>
</div>

<div id="outline-container-orgcaa0fd4" class="outline-4">
<h4 id="orgcaa0fd4"><span class="section-number-4">2.3.2</span> irc</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
the self hosted <a href="https://github.com/matrix-org/matrix-appservice-irc">matrix-appservice-irc bridge</a> is what most people seem to use. i have used the <i>hosted</i> version on matrix.org before; i hated it. it was great to be able to talk to folks on freenode channels from element, especially given that there is no reasonable irc client on iOS! but the UX is just bad.
</p>

<p>
i've started the learning process for self hosting it myself and having the bridge treat my existing IRC bouncer as a separate IRC network but that's pretty undocumented. there are no quick and dirty guides about it, and especially since i'm isolating at home all the time now, my drive to solve this iOS irc client problem has cratered. i <i>have</i> verified with the bridge maintainer that what i want to do is possible; its just relatively niche and hasn't been written about.
</p>
</div>
</div>

<div id="outline-container-org7f847c8" class="outline-4">
<h4 id="org7f847c8"><span class="section-number-4">2.3.3</span> discord</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
i'm using the <a href="https://github.com/matrix-discord/mx-puppet-discord">mx-puppet-discord</a> bridge for bridging in discord channels. I tried using the <a href="https://github.com/Half-Shot/matrix-appservice-discord">appservice discord</a> bridge but had a <i>devil</i> of a time getting it to work. mx-puppet-discord works and has (imo) a better user experience for admins, though it does seem pretty finnicky. from what I can tell, more finnicky than the appservice. at least this one i can get to run though!!
</p>
</div>
</div>

<div id="outline-container-org4290f18" class="outline-4">
<h4 id="org4290f18"><span class="section-number-4">2.3.4</span> combining bridges in a single room</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
a thing that i think is fucking <i>cool</i> and also probably a source of some of my problems is: i currently use some of these bridges to create a frankenstein room, that does bidirecitonal send like discord &lt;-&gt; matrix &lt;-&gt; slack; the channel "mothra-fuckers" (shut up) in discord talks to the channel "mothra-fuckers" in  matrix, which is also bridged to "mothra-fuckers" in slack, and anyone in any of those channels can talk to all three platforms! rad!
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3887808" class="outline-2">
<h2 id="org3887808"><span class="section-number-2">3</span> avoiding common pitfalls of self hosting</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9b16adb" class="outline-3">
<h3 id="org9b16adb"><span class="section-number-3">3.1</span> deployment</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I think the first thing you should do is eschew configuring synapse and all these bridges on your own. that fucking sucks. use <a href="https://github.com/spantaleev/matrix-docker-ansible-deploy">this set</a> of ansible roles, these guys are great, continuously update stuff, and provide meaningful changelogs for updates. their documentation is not always lovely, especially about the optional plugins they offer, but have been enough to get me started on solving the problem every time so far.
</p>

<p>
I forked their repo and periodically update it from <code>upstream/master</code> to pull in latest changes when I have time to commit to problem solving any issues. Mostly I don't have problems, but occasionally there are big version updates that have done things like enforce migrations from sqlite to pgsql, or enforced breaking changes with TLS, etc. 
</p>
</div>
</div>

<div id="outline-container-orgf5a2b73" class="outline-3">
<h3 id="orgf5a2b73"><span class="section-number-3">3.2</span> disk space</h3>
<div class="outline-text-3" id="text-3-2">
<p>
one of the things i keep intending to do (and have thus far put off) is move away from relying on raw disks attached to DO droplet and move towards object storage with s3/do spaces/ whatever. This is made easy if you use the previously mentioned set of ansible roles. if you don't do this, you will have to periodically go in and delete old media or add a bunch of new disk space.
</p>

<p>
if you really must go with disks and not object storage for some reason I recommend that you use external, non OS drives for very Obvious linux admin reasons. Much easier to snapshot / do backups on that sort of thing.
</p>
</div>
</div>

<div id="outline-container-org915de9a" class="outline-3">
<h3 id="org915de9a"><span class="section-number-3">3.3</span> backups!</h3>
<div class="outline-text-3" id="text-3-3">
<p>
you should do backups. I haven't figured out a particularly great method here, yet. I do full VM snapshots through my cloud provider, but pulling data out of that environment on a regular basis is something I haven't worked out how to do well. <a href="https://github.com/matrix-org/synapse/issues/2046">here</a> is a github issue that has some community opinions on what to backup, but there's still no official guidance as far as I know.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfebc999" class="outline-2">
<h2 id="orgfebc999"><span class="section-number-2">4</span> talk to me about matrix!</h2>
<div class="outline-text-2" id="text-4">
<p>
i really like matrix. i think there's a lot of cool stuff here, and I hope that it continues to improve. if you run into issues with matrix, have some questions about it you aren't sure where to ask, or just wanna chat about it, please talk to me! I've got several years experience running my home server, and all my friends are tired of hearing about matrix lmao. i'm <a href="mailto:me@jowj.net">mailto:me@jowj.net</a> on email, or @jowj:awful.club on matrix.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p></p>
</div>
</body>
</html>
